Diverging_Converging_Duct/turbulentDuct/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.633;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.633;
    }
    wall
    {
        type            epsilonWallFunction;
        value           uniform 0.633;
    }

     outlet
    {
      type            zeroGradient;
    }

     centerline
    {
        type            symmetryPlane;
    }

    frontAndBack
      {
        type            empty;
    }
}


// ************************************************************************* //
