Diverging_Converging_Duct/turbulentDuct/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0167705;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0167705;
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform 0.0167705;
    }


     outlet
    {
      type            zeroGradient;
    }

     centerline
    {
        type            symmetryPlane;
    }


    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
